"Back" = "Tillbaka";
"Continue" = "Fortsätt utan";
"create New User" = "Skapa ny profil";
"Create New User Info" = "Here you can create a personal TimeFor.TV profile. This helps you store your settings between devices and gives you extra features.";
"create Your New Account" = "Skapa ny profil";
"Email Address" = "E-postadress ";
"Your Email Address" = "E-postadress ";
"Login" = "Logga in";
"Login Subscribtion Info" = "För att få full tillgång till funktioner från TimeFor.TV rekommenderar vi dig att logga in via en profil";
"Mobile" = "Mobilnummer för SMS-påminnelser ";
"Name" = "Namn";
"Password" = "Lösenord";
"Register Mobile for SMS Info" = "* Ditt mobilnummer kommer användas om du önskar ta emot SMS-påminnelser. Besök timefor.tv/prdukter/sms för mer information och förutsättningar.";
"Add Channels" = "Lägg till kanaler ";
"Channels" = "Kanaler ";
"Channel.no.air.1" = "Uppehåll i sändningen";
"Channel.no.air.2" = "Tab to see full day";
"Channel.no.transmission.1" = "Inga sändningar just nu";
"Channel.no.transmission.2" = "Tab to see full day";
"Edit Channels Navigation Title " = "Redigera kanaler ";
"Please Select Channels before Adding" = "Please select channels before adding";
"Save" = "Spara";
"Search Channel" = "Search Channel";
"Search Programs" = "Sök i tv-tablån ";
"Searched" = "Sök";
"Shows" = "Program:";
"Synching Channels" = "Fångar innehåll";
"Today" = "Idag";
"Logout" = "Logga ut";
"Logout Cell" = "Du är inloggad som";
"Push Notification Cell" = "Push notification tillbehör";
"No Commercial" = "Avaktivera annonser på TimeFor.TV";
"Recommendation" = "Rekommendationer ";
"Recommend" = "Rekommendera";
"Don't recommend" = "Rekommendera inte";
"Select Date" = "Välj dag";
"By Agent" = "Av agent";
"Keyboard.done" = "Done";
"Segment.planned" = "Planerat ";
"Segment.agents" = "Agenter";
"Edit planning" = "Redigera plannering ";
"Add planning" = "Planera";
"Edit" = "Redigera";
"Edit agent" = "Redigera";
"Add notification" = "Annonspåminnelse ";
"Search in" = "Sök i";
"Original Title" = "Originaltitel ";
"Title" = "Titel";
"Summary" = "Summering";
"All" = "Alla";
"Title or summary" = "Titel eller summering";
"Remind me" = "Påminn mig";
"Remind me via" = "Påminn mig genom";
"Remind Time" = "Tid";
"Remind me when it's aired" = "Påminn mig när det sänds";
"Plan every time it's aired" = "Planera varje gång";
"Select Days" = "Choose days";
"Search Target" = "Sök i";
"Search Type" = "Söktyp";
"Select Channel" = "Välj kanal";
"Minutes before" = "Minutes before";
"Hours before" = "Hours before";
"Days before" = "Days before";
"On days" = "On days";
"Weekdays(mon-fri)" = "Veckodagar";
"Weekends(sat-sun)" = "Helger";
"Mondays" = "Måndagar";
"Tuesdays" = "Tisdagar";
"Wednesdays" = "Onsdagar";
"Thursdays" = "Torsdagar";
"Fridays" = "Fredagar";
"Saturdays" = "Lördagar";
"Sundays" = "Söndagar";
"All weekdays" = "När som";
"All hours" = "När som";
"Is" = "är";
"Contains" = "innehåller";
"Begins with" = "börjar med";
"Ends with" = "slutar med";
"Between" = "Mellan";
"On" = "onon";
"Show short summary in listings" = "Visa kort summering i tablån";
"Settings" = "Inställningar";
"From" = "Från";
"On channels" = "Kanaler ";
"Plan all airings where" = "Planera alla sändningar där";
"Limitations" = "Begränsningar";
"Plans" = "Planerat ";
"Plan" = "Planera";
"Find on IMDB" = "Search IMDB";
"Share on Facebook" = "Dela på Facebook";
"You post is now shared" = "You post is now shared";
"No records found" = "Inga sändningar kunde hittas";
"Please provide us with a valid email address" = "Vad god ange giltig e-postadress";
"Please fill name, email and password as minimum" = "Please fill name, email and password as minimum";
"Disable commercials on TimeFor.TV (apps)" = "Avaktivera annonser på TimeFor.TV (appar)";
"Full version of TimeFor.TV for iPhone and iPad" = "Full version av TimeFor.TV för iPhone och iPad";
"Full version of TimeFor.TV for Android" = "Full version av TimeFor.TV för Android ";
"Full version of TimeFor.TV for Windows" = "Full version av TimeFor.TV för Windows";
"Full version of TimeFor.TV for Facebook" = "Full version av TimeFor.TV för Facebook";
"Full version of TimeFor.TV for Mac" = "Full version av TimeFor.TV för Mac";
"Download EPG data as XMLTV for your media center" = "Ladda ner EPG data som XMLTV för ditt mediacenter";
"Demands a TimeFor.TV Pro or TimeFor.TV+ subscription beginning at only EUR 5 an year" = "Begär en TimeFor.TV Pro eller TimeFor.TV+ prenumeration som börjar på endast SEK 39,- om året";
"Functions" = "Funktioner";
"EUR 5/year" = "EUR 5/year";
"EUR 15/year" = "EUR 15/year";